import { cn } from "@/lib/utils"
import Title from "../UI/Title"
import { Elem } from "./Elem"

export type Step = {
    id: number,
    title: string,
    desc: string
}

const listSpet: Step[] = [
    { id: 1, title: 'Познакомься с нашей деятельностью', desc: 'Для этого достаточно посмотреть наш сайт, публикуемые посты, ВК-клипы или видео. Если ты любишь ИТ, медиа или просто хочешь менять мир к лучшему, то ты нам подходишь!' },
    { id: 2, title: 'Реши, над чем ты хочешь работать', desc: 'В нашем объединении ты можешь кодить, дизайнить, общаться с ИТ-компаниями, писать посты и многое другое. Подробнее про отделы ЮНИТ, над чем ты сможешь работать и в каких сферах мы помогаем развиваться  — в посте.' },
    { id: 3, title: 'Заполни анкету на вступление', desc: 'Внимательно отнесись к этому шагу, ведь именно по анкете принимается решение о приглашении кандидата. Отвечай максимально честно и подробно, чтобы быстрее перейти к следующему шагу.' },
    { id: 4, title: 'Приходи на собеседование', desc: 'На нём ты сможешь задать вопросы и рассказать, чем ЮНИТ может быть полезен именно тебе. Во время собеседования тебе могут задать вопросы по анкете, которую ты заполнял.' }
]

export function HowGetInto() {
    return (
        <>
            <Title title="Как попасть в ЮНИТ" />
            <div className="grid grid-cols-2 gap-x-[20px] gap-y-[20px]">
                {
                    listSpet.map((obj, index) => <Elem key={index} obj={obj} />)
                }
            </div>
            <div className={cn(
                'text-[60px] text-white text-center w-full bg-[#5c5c5c] rounded-2xl mt-[30px] mb-[100px]',
                'hover:translate-y-[-5px] transition-all duration-300 cursor-pointer'
            )}>Хочу к вам</div>
        </>
    )
}